Revit 2027 API
AdaptiveComponentFamilyUtils.SetPlacementNumber Method
 Sets Placement Number of an Adaptive Placement Point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetPlacementNumber(
	Document doc,
	ElementId refPointId,
	int placementNumber
)
Public Shared Sub SetPlacementNumber (
	doc As Document,
	refPointId As ElementId,
	placementNumber As Integer
)
public:
static void SetPlacementNumber(
	Document^ doc,
	ElementId^ refPointId,
	int placementNumber
)
static member SetPlacementNumber :
        doc : Document *
        refPointId : ElementId *
        placementNumber : int -> unit
Parameters
doc Document
 The Document
refPointId ElementId
 The ReferencePoint id
placementNumber Int32
 Placement number of the Adaptive Placement Point.
Exceptions
Exception | Condition
ArgumentException |  The ElementId refPointId does not correspond to a valid ReferencePoint. -or- The Element corresponding to ElementId refPointId does not belong to an Adaptive Family. -or- The ElementId refPointId does not correspond to an Adaptive Placement Point. -or- The number placementNumber is out of range.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation failed.
See Also
Reference
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace